[
    {
        "id": 1,
        "nome": "Introdução à Programação com Python",
        "descricao": "Aprenda lógica e fundamentos de Python",
        "carga_horaria": 40
    },
    {
        "id": 5,
        "nome": "Django",
        "descricao": "Neste curso de Django, você aprenderá a criar aplicações web completas, desde o entendimento dos conceitos básicos até a implementação de funcionalidades avançadas. Você desenvolverá habilidades em desenvolvimento backend, banco de dados e integração de APIs, tornando-se capaz de construir sites dinâmicos e seguros. Com aulas práticas e suporte dedicado, este curso é perfeito para quem deseja transformar ideias em projetos reais e ampliar seu portfólio. Ao final, estará preparado para atuar como desenvolvedor Django e impulsionar sua carreira na área de tecnologia.",
        "carga_horaria": 35
    },
    {
        "id": 6,
        "nome": "Introdução à Programação Orientada a Objetos",
        "descricao": "Neste curso de Introdução à Programação Orientada a Objetos, você trabalhará os conceitos essenciais como classes, objetos, herança e encapsulamento, aprendendo a estruturar código de forma mais eficiente e modular. Desenvolverá habilidades em lógica de programação e na criação de aplicativos mais organizados, facilitando projetos futuros. Essa formação é ideal para quem deseja iniciar na programação ou aprimorar seus conhecimentos, abrindo portas para oportunidades na área de desenvolvimento de software. Ao final, você estará preparado para criar programas mais robustos, escaláveis e fáceis de manter.",
        "carga_horaria": 10
    },
    {
        "id": 7,
        "nome": "Curso de React Avançado",
        "descricao": "Curso aprofundado de React, abordando tópicos avançados como hooks personalizados, gerenciamento de estado complexo, patrones de projeto, otimizações de performance e testes avançados em React.",
        "carga_horaria": 30
    },
    {
        "id": 8,
        "nome": "Curso de Data Science",
        "descricao": "Curso introdutório de Data Science com foco em conceitos essenciais, ferramentas e técnicas, totalizando 20 horas de duração.",
        "carga_horaria": 20
    }
]