[
  {
    "id": 1,
    "nome": "Introdução à Programação com Python",
    "descricao": "Neste curso de Introdução à Programação com Python, você aprenderá os fundamentos da lógica de programação, estruturas de decisão, loops e funções. Também entenderá como trabalhar com listas, dicionários e manipulação de arquivos, desenvolvendo suas primeiras aplicações práticas. Ideal para iniciantes que desejam começar na área de tecnologia e adquirir base sólida para linguagens mais avançadas.",
    "carga_horaria": 50
  },
  {
    "id": 2,
    "nome": "Fundamentos de HTML e CSS",
    "descricao": "Aprenda a criar páginas web do zero com HTML e CSS, dominando a estrutura de documentos, hierarquia de elementos e técnicas de estilização moderna. O curso aborda boas práticas de design responsivo e acessibilidade, preparando você para desenvolver interfaces visualmente atraentes e compatíveis com diferentes dispositivos.",
    "carga_horaria": 30
  },
  {
    "id": 3,
    "nome": "JavaScript para Iniciantes",
    "descricao": "Neste curso de JavaScript, você aprenderá os conceitos essenciais da linguagem que dá vida às páginas web. Desde variáveis e funções até manipulação do DOM e eventos, o conteúdo é repleto de exemplos práticos para aplicar o aprendizado imediatamente. Ao final, será capaz de desenvolver páginas interativas e dinâmicas.",
    "carga_horaria": 40
  },
  {
    "id": 4,
    "nome": "Banco de Dados com MySQL",
    "descricao": "Aprenda a projetar, modelar e consultar bancos de dados relacionais com MySQL. Você entenderá conceitos de chaves primárias, relacionamentos, normalização e comandos SQL fundamentais, além de boas práticas de desempenho e segurança. Ideal para quem deseja integrar bancos de dados a aplicações web e desktop.",
    "carga_horaria": 25
  },
  {
    "id": 5,
    "nome": "Django",
    "descricao": "Neste curso de Django, você aprenderá a criar aplicações web completas, desde o entendimento dos conceitos básicos até a implementação de funcionalidades avançadas. Você desenvolverá habilidades em desenvolvimento backend, banco de dados e integração de APIs, tornando-se capaz de construir sites dinâmicos e seguros. Com aulas práticas e suporte dedicado, este curso é perfeito para quem deseja transformar ideias em projetos reais e ampliar seu portfólio. Ao final, estará preparado para atuar como desenvolvedor Django e impulsionar sua carreira na área de tecnologia.",
    "carga_horaria": 35
  },
  {
    "id": 6,
    "nome": "C# e Programação Orientada a Objetos",
    "descricao": "Neste curso, você aprenderá a programar em C# de forma moderna e eficiente. O conteúdo aborda classes, objetos, herança, encapsulamento e polimorfismo, além de boas práticas para construção de sistemas escaláveis. Ao longo das aulas, serão desenvolvidas aplicações reais com interface gráfica e integração a banco de dados.",
    "carga_horaria": 45
  },
  {
    "id": 7,
    "nome": "Curso Avançado de React",
    "descricao": "Aprofunde seus conhecimentos em React aprendendo sobre hooks personalizados, contexto global, roteamento dinâmico e consumo de APIs REST. O curso inclui boas práticas de componentização, otimização de desempenho e integração com bibliotecas modernas. Ideal para quem já domina o básico e quer desenvolver projetos profissionais.",
    "carga_horaria": 20
  },
  {
    "id": 8,
    "nome": "Introdução à Programação Orientada a Objetos",
    "descricao": "Aprenda os conceitos fundamentais da Programação Orientada a Objetos (POO), como classes, métodos, herança e abstração. Este curso ajuda a estruturar códigos de forma eficiente e reutilizável, preparando você para linguagens como Java, Python e C#. Ideal para quem deseja programar com organização e escalabilidade.",
    "carga_horaria": 15
  },
  {
    "id": 9,
    "nome": "Desenvolvimento Web com Node.js",
    "descricao": "Aprenda a construir aplicações backend com Node.js e Express, desenvolvendo APIs REST, rotas e autenticação de usuários. O curso aborda integração com bancos de dados, tratamento de erros e boas práticas de segurança. Ideal para quem deseja dominar o ecossistema JavaScript do lado do servidor.",
    "carga_horaria": 35
  },
  {
    "id": 10,
    "nome": "Git e Controle de Versão",
    "descricao": "Aprenda a versionar seus projetos com Git e GitHub, compreendendo o uso de commits, branches, merges e pull requests. O curso ensina também estratégias de colaboração em equipe e resolução de conflitos de código, garantindo um fluxo de trabalho organizado e profissional em qualquer projeto de software.",
    "carga_horaria": 10
  },
  {
    "id": 11,
    "nome": "Engenharia de Software",
    "descricao": "Com este curso, você compreenderá o ciclo de vida do software, desde a análise de requisitos até a manutenção. São abordados tópicos como metodologias ágeis, documentação técnica, testes e qualidade de software. Ideal para quem deseja atuar no planejamento e desenvolvimento de sistemas complexos.",
    "carga_horaria": 40
  },
  {
    "id": 12,
    "nome": "Desenvolvimento Mobile com React Native",
    "descricao": "Aprenda a criar aplicativos móveis nativos para Android e iOS utilizando React Native. O curso cobre componentes, navegação, armazenamento local e consumo de APIs. Com exemplos práticos, você desenvolverá apps completos, prontos para publicação nas lojas digitais.",
    "carga_horaria": 50
  },
  {
    "id": 13,
    "nome": "Segurança da Informação",
    "descricao": "Neste curso, você entenderá os principais conceitos de segurança digital, criptografia, autenticação e proteção de dados. Também aprenderá boas práticas para prevenir ataques e vulnerabilidades em sistemas e redes. Um conteúdo essencial para qualquer profissional de tecnologia que preza pela segurança da informação.",
    "carga_horaria": 30
  },
  {
    "id": 14,
    "nome": "Java Avançado",
    "descricao": "Aprofunde seus conhecimentos em Java explorando coleções, threads, tratamento de exceções e acesso a bancos de dados. O curso também aborda a criação de APIs e o uso de frameworks populares do ecossistema Java. Ideal para quem já domina o básico e quer evoluir para o desenvolvimento profissional.",
    "carga_horaria": 40
  },
  {
    "id": 15,
    "nome": "Linux para Desenvolvedores",
    "descricao": "Aprenda os comandos e ferramentas essenciais do Linux voltados para o desenvolvimento de software. O curso aborda terminal, permissões, gerenciamento de pacotes e automação com scripts. Ao final, você estará apto a usar Linux como sistema principal para programação e deploys em servidores.",
    "carga_horaria": 20
  },
  {
    "id": 16,
    "nome": "APIs RESTful com Express",
    "descricao": "Domine o desenvolvimento de APIs RESTful utilizando o framework Express no Node.js. Você aprenderá a estruturar rotas, autenticar usuários e integrar serviços externos com segurança. O curso inclui práticas reais de deploy e versionamento de endpoints, preparando você para o mercado backend moderno.",
    "carga_horaria": 25
  },
  {
    "id": 17,
    "nome": "MongoDB Essencial",
    "descricao": "Aprenda os fundamentos do banco de dados NoSQL MongoDB, compreendendo a modelagem de documentos, consultas avançadas e agregações. O curso aborda integração com Node.js e boas práticas de desempenho, ideal para quem deseja trabalhar com bancos de dados modernos e escaláveis.",
    "carga_horaria": 20
  },
  {
    "id": 18,
    "nome": "TypeScript para Desenvolvedores",
    "descricao": "Neste curso, você aprenderá a tipar aplicações JavaScript com segurança e produtividade utilizando TypeScript. O conteúdo inclui interfaces, tipos genéricos, módulos e integração com frameworks populares. Ideal para quem busca escrever códigos mais robustos e escaláveis.",
    "carga_horaria": 25
  },
  {
    "id": 19,
    "nome": "Flask e APIs em Python",
    "descricao": "Aprenda a criar APIs leves e eficientes com Flask, um dos frameworks mais populares do ecossistema Python. O curso cobre rotas, autenticação JWT, integração com bancos de dados e deploy em nuvem. Ideal para quem deseja construir aplicações modernas e rápidas utilizando Python.",
    "carga_horaria": 30
  },
  {
    "id": 20,
    "nome": "Introdução à Inteligência Artificial",
    "descricao": "Neste curso introdutório, você conhecerá os fundamentos da Inteligência Artificial, incluindo aprendizado de máquina, redes neurais e algoritmos de classificação. O conteúdo é apresentado de forma acessível, com exemplos práticos e aplicações reais em diversas áreas. Ideal para quem quer iniciar nessa área promissora.",
    "carga_horaria": 35
  },
  {
    "id": 21,
    "nome": "Desenvolvimento com flutter",
    "descricao": "Neste curso de Desenvolvimento com Flutter, você irá aprender a criar aplicativos móveis de alta performance para Android e iOS, dominando desde os conceitos básicos até técnicas avançadas de interface e integração. Com habilidades em Dart, desenvolvimento de interfaces responsivas e gerenciamento de estados, estará preparado para migrar sua carreira para o universo do Flutter e oferecer soluções inovadoras. Ideal para profissionais que desejam expandir seu portfólio, aumentar sua empregabilidade e criar aplicativos multiplataforma de forma eficiente e modernizada. Transforme seu potencial e destaque-se no mercado de tecnologia com este curso completo!",
    "carga_horaria": 20
  }
]
